IRP/src/InformationRegisters/T9012S_AccountsPartner/T9012S_AccountsPartner.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9012S_AccountsPartner</name>
 <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
 <resources>
  <name>AccountAdvancesVendor</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountTransactionsVendor</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountAdvancesCustomer</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountTransactionsCustomer</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountTransactionsOther</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerTypeVariant</name>
  <type>
   <types>CatalogRef.LedgerTypeVariants</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Vendor</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Customer</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Other</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/AgreementTypes/AgreementTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementTypes</name>
 <enumValues>
  <name>Customer</name>
 </enumValues>
 <enumValues>
  <name>Vendor</name>
 </enumValues>
 <enumValues>
  <name>Consignor</name>
 </enumValues>
 <enumValues>
  <name>TradeAgent</name>
 </enumValues>
 <enumValues>
  <name>Other</name>
 </enumValues>
</mdclass:Enum>

IRP/src/InformationRegisters/T9012S_AccountsPartner/Forms/RecordForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.Items.RecordType.ChoiceList.Add("All"     , R().CLV_1);
	ThisObject.Items.RecordType.ChoiceList.Add("Partner"   , Metadata.Catalogs.Partners.ObjectPresentation);
	ThisObject.Items.RecordType.ChoiceList.Add("Agreement" , Metadata.Catalogs.Agreements.ObjectPresentation);
	ThisObject.Items.RecordType.ChoiceList.Add("Currency"  , Metadata.Catalogs.Currencies.ObjectPresentation);
	
	If ValueIsFilled(Record.Partner) Then
		ThisObject.RecordType = "Partner";
	ElsIf ValueIsFilled(Record.Agreement) Then
		ThisObject.RecordType = "Agreement";
	ElsIf ValueIsFilled(Record.Currency) Then
		ThisObject.RecordType = "Currency";
	Else
		ThisObject.RecordType = "All";
	EndIf;
	SetVisible();
EndProcedure

&AtClient
Procedure RecordTypeOnChange(Item)
	SetVisible();
EndProcedure

&AtClient
Procedure VendorOnChange(Item)
	SetVisible();
EndProcedure

&AtClient
Procedure CustomerOnChange(Item)
	SetVisible();
EndProcedure

&AtClient
Procedure OtherOnChange(Item)
	SetVisible();
EndProcedure

&AtClient
Procedure AgreementOnChange(Item)
	If ValueIsFilled(Record.Agreement) Then
		AgreementType = CommonFunctionsServer.GetRefAttribute(Record.Agreement, "Type");
		Record.Customer = (AgreementType = PredefinedValue("Enum.AgreementTypes.Customer"));
		Record.Vendor = (AgreementType = PredefinedValue("Enum.AgreementTypes.Vendor"));
		Record.Other = (AgreementType = PredefinedValue("Enum.AgreementTypes.Other"));
	EndIf;	
	SetVisible();
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	If ThisObject.RecordType <> "Partner" Then
		CurrentObject.Partner = Undefined;
	EndIf;

	If ThisObject.RecordType <> "Agreement" Then
		CurrentObject.Agreement = Undefined;
	EndIf;
	
	If ThisObject.RecordType <> "Currency" Then
		CurrentObject.Currency = Undefined;
	EndIf;
	
	If Not CurrentObject.Vendor Then
		CurrentObject.AccountAdvancesVendor = Undefined;
		CurrentObject.AccountTransactionsVendor = Undefined;
	EndIf;
	
	If Not CurrentObject.Customer Then
		CurrentObject.AccountAdvancesCustomer = Undefined;
		CurrentObject.AccountTransactionsCustomer = Undefined;
	EndIf;
	
	If Not CurrentObject.Other Then
		CurrentObject.AccountTransactionsOther = Undefined;
	EndIf;
EndProcedure

&AtServer
Procedure SetVisible()
	Items.Partner.Visible   = ThisObject.RecordType = "Partner";
	Items.Agreement.Visible = ThisObject.RecordType = "Agreement";
	Items.Currency.Visible  = ThisObject.RecordType = "Currency";
	
	Items.GroupVendor.Visible                 = Record.Vendor;
	Items.AccountAdvancesVendor.Visible       = Record.Vendor;
	Items.AccountTransactionsVendor.Visible   = Record.Vendor;
	
	Items.GroupCustomer.Visible               = Record.Customer;
	Items.AccountAdvancesCustomer.Visible     = Record.Customer;
	Items.AccountTransactionsCustomer.Visible = Record.Customer;
	
	Items.GroupOther.Visible                  = Record.Other;
	Items.AccountTransactionsOther.Visible    = Record.Other;
EndProcedure
